[
  {
    "id": 1,
    "name": "Thomas",
    "img": "https://randomuser.me/api/portraits/thumb/men/10.jpg",
    "comment": "Apple is reportedly planning to declare three models of MacBook obsolete in April. MacRumors reports that Apple is going to add the 11-inch MacBook Air, 13-inch MacBook Air, and 13-inch MacBook Pro models released in early 2014 to its obsolete products list this month. The move would hardly come as a surprise. Apple has released new versions of the 13-inch MacBook Air and MacBook Pro—most notably with its custom silicon—in the last eight years.",
    "ratings": "4.6"
  },
  {
    "id": 2,
    "name": "Christopher",
    "img": "https://randomuser.me/api/portraits/thumb/men/55.jpg",
    "comment": "Apple is thought to be planning a new, larger model of the MacBook Air, which will be released alongside an updated 13-inch model in late 2023. As 9To5Mac reports, the prediction comes from Display Supply Chain Consultants (DSCC), which just released its Quarterly Advanced IT Display Shipment and Technology report. The report suggests that Apple is planning to increase the size of the display in the 13.3-inch MacBook Air, but it would still remain under 14 inches.",
    "ratings": "4.5"
  },
  {
    "id": 3,
    "name": "Timothy",
    "img": "https://randomuser.me/api/portraits/thumb/men/56.jpg",
    "comment": "Apple's M1 silicon debuted to great fanfare a year ago, infusing the entry-level 2020 MacBook Air with extraordinary computing power for a laptop of its size and price. At the time, the 13-inch MacBook Pro rang up as the lesser value, since it cost more but used the same M1 processor that the MacBook Air did. Apple now changes the equation—and opens up the Pro to a wider swath of content pros—with the 14-inch MacBook Pro (starts at $1,999; $2,899 as tested). ",
    "ratings": "4.2"
  },
  {
    "id": 4,
    "name": "Nicholas",
    "img": "https://randomuser.me/api/portraits/thumb/women/50.jpg",
    "comment": "The new 14-inch MacBook Pro has so many advantages over the 13-inch model that, if you are a professional user bound to macOS, and with the cash to invest in a seriously capable workhorse, your decision really comes down to whether you should buy the 14-inch or the 16-inch model. You can safely leave the 13-inch M1 MacBook Pro model off the list. (At this writing, Apple continues to sell it without having updated it from the plain-M1 configuration announced last year.",
    "ratings": "4.9"
  },
  {
    "id": 5,
    "name": "Brandon",
    "img": "https://randomuser.me/api/portraits/thumb/women/43.jpg",
    "comment": "It's not often that input and output ports are a headline feature on a laptop, but it's certainly the case with the new MacBook Pro. Five years ago, Apple ditched most of the ports on its laptops, placing all its connectivity eggs in the USB-C/Thunderbolt basket. A chorus of woe rose from the online Apple-sphere, where commenters and commenters complained that laptops need more than just one type of port.",
    "ratings": "4.7"
  },
  {
    "id": 6,
    "name": "Harold",
    "img": "https://randomuser.me/api/portraits/thumb/women/33.jpg",
    "comment": "Apple's MacBook Air has been a known quantity for years, a favorite among super-thin ultraportables, but one that received only occasional, modest updates. We liked the model updated in early 2020, but its keyboard improvements aside, it was not a transformative edition. The MacBook Air's performance has always remained secondary to its price and size, but that paradigm has shifted with the introduction of Apple’s own M1 processor. Alongside its new OS update, Apple dropped its long-running use of Intel processors for this homegrown silicon solution",
    "ratings": "4.6"
  }
]